-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: May 17, 2023 at 11:02 PM
-- Server version: 10.4.27-MariaDB
-- PHP Version: 8.1.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `tadwenat`
--

-- --------------------------------------------------------

--
-- Table structure for table `admin`
--

CREATE TABLE `admin` (
  `id_pass` int(11) NOT NULL,
  `e_mail` varchar(200) NOT NULL,
  `passw` varchar(200) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `admin`
--

INSERT INTO `admin` (`id_pass`, `e_mail`, `passw`) VALUES
(1, 'majd@gmail.com', 'majd777'),
(2, 'nour@yaho.com', 'nour885');

-- --------------------------------------------------------

--
-- Table structure for table `categories`
--

CREATE TABLE `categories` (
  `cat_id` int(11) NOT NULL,
  `cat_name` varchar(100) NOT NULL,
  `cat_date` datetime NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `categories`
--

INSERT INTO `categories` (`cat_id`, `cat_name`, `cat_date`) VALUES
(1, 'بلوجر ', '2023-05-06 02:06:34'),
(2, 'اسلاميلات', '2023-05-06 02:10:07'),
(34, 'برمجة', '2023-05-11 00:42:53'),
(36, 'صحة', '2023-05-11 22:17:40');

-- --------------------------------------------------------

--
-- Table structure for table `post`
--

CREATE TABLE `post` (
  `id` int(11) NOT NULL,
  `post_title` varchar(200) NOT NULL,
  `post_catigory` varchar(200) NOT NULL,
  `post_img` varchar(200) NOT NULL,
  `post_content` varchar(10000) NOT NULL,
  `post_date` datetime NOT NULL DEFAULT current_timestamp(),
  `post_auther` varchar(70) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_general_ci;

--
-- Dumping data for table `post`
--

INSERT INTO `post` (`id`, `post_title`, `post_catigory`, `post_img`, `post_content`, `post_date`, `post_auther`) VALUES
(73, 'كيف تصبح هاكر في اسبوع', 'برمجة', '365_صور الهكر 2019 بدقة عالية (4).jpg', 'سوف نتعلم كيف يمكنك ان تصبح هاكر في اسبوع\r\nتابع معنا الشرح\r\n\r\n\r\nشكرا لقراءة المقال الفارغ', '2023-05-09 23:55:31', 'عبد الرحمن'),
(77, 'انواع البانات المستخدمة في السيرفرات الأمريكية', 'برمجة', '203_8007447385aedd275c05086.19805718-shutterstock-664640113.png', 'انواع البانات المستخدمة في السيرفرات الأمريكية هي الكثيرمن الانواع المستخدمة اليوم وفي امرسكاالكثير منالوليات وفي كل ولاية لها نظام معين من البيانات لذا تختلف انواع البانات من ولاية الى ولاية  اخرى حسب النظام المستخدم في كل ولاية \r\nالمهم اني لا اعرف ما هو النظام المستخدم في الولايات الامريكية المتحدة  لكن يجب ان يكون المقال طويل حتى ارى كيف سيظهر البوست في الصفحة الرئيسية\r\nشكرا  لقراءة خذا المقال الذي بندون اي قيمة \r\nشكرا جززززيلا', '2023-05-11 00:46:22', 'عبد الرحمن'),
(78, 'كيف أهتم ب صحتي', 'صحة', '890_كيف_أهتم_بصحتي.jpg', 'الصحة هي كنزُ لا يشعر بقيمته إلّا من فقده؛ لذلك يٌقال: \"الصحة تاجُ على رؤوس الأصحاء\" أي لا يراه سوى المرضى، فحياة الإنسان تعتمد بشكل أساسي على صحته، ولا يتساوى الناس في مستوى صحتهم فعاداتهم تختلف عن بعضها البعض، لذلك سنقدّم اليوم بعض النصائح التي من شأنها توّضح كيفية الاهتمام بالصحة. تناول الغذاء الصحّي، وهذه هي الخطوة الأساسية في المحافظة على الصحة، فما يدخل إلى الفم يٌعتبر الخطوة الأولى إلى الاتجاه نحو الصحة أو المرض، فمن المهم المحافظة على صحة أجهزة الجسم ومنها جهاز المناعة، ومن النصائح التي تخص الغذاء الصحي: احتواء الغذاء على العناصر الغذائية المختلفة التي يحتاج اليها الجسم مثل البروتينات، والكربوهيدرات، والفيتامينات، والأملاح المعدنية، والدهون، وكلها يجب أن تكون بنسبٍ مناسبة حسب احتياج الجسم وعاداته اليومية. التقليل من استخدام الملح والسكر فلهما الكثير من الأضرار على الجسم. استبدال الخبز الأبيض بالخبز الأسمر فهو يحتوي على القشور الكاملة للحبوب. شرب الماء والسوائل بكثرة؛ فيجب شرب ما لا يقل عن ثمانية أكواب يومياً، فالماء ضروري لتنقية الجسم من السموم وطردها إلى الخارج، كما أنّ الخلايا تحتاج الماء لإتمام عملها؛ فالجسم إذا أصابه الجفاف أصبح عرضةً لغزو الفيروسات والجراثيم المسبّبة للأمراض. مضغ الطعام جيداً وقبل بلعه فهذا من شأنه مساعدة الجهاز الهضمي في عمله، كما أنّ البطء في المضغ يساعد في الشعور بالشبع بسرعة، ويساعد في إطلاق المواد الكيميائية المضادّة للسرطان من بعض الأطعمة. المحافظة على تناول المنتوجات البحرية بسبب احتوائها على أحماض أوميغا ٣ المهمّة للدماغ. الابتعاد عن تناول الوجبات الجاهزة المليئة بالدهون والكولسترول الضار الذي يسبب اغلاق الشرايين والأوردة ممّا يؤدي إلى قلة الدم الواصل إلى الخلايا والأنسجة مما يجبر القلب على زيادة دفع الدم وبالتالي اصابته بالتعب والإرهاق. التقليل من شرب المنبهات مثل القهوة والشاي لأنّها تسبب زيادة إدرار البول ممّا يزيد من نقصان السوائل في الجسم. ممارسة التمارين الرياضية، فالرياضة مهة جداً في تنشيط الدورة الدموية في الجسم وسهولة تحرّك الدم، كما تفيد في التخلص من الوزن الزائد الذي هو سبب في الكثير من الأمراض، ولا بد من الانتباه إلى أنه ليس من الشرط ممارسة التمارين الرياضية الشاقة للاستفادة منها؛ فالمشي اليومي لمدة نصف ساعة يزيد من نشاط الجسم ويحميه من الأمراض. الابتعاد عن الضغط النفسي والقلق والتوتر فهي تعمل على تدمير الحالة النفسية وبالتالي سهولة الإصابة بالأمراض. الابتعاد عن إرهاق النفس في أداء الأعمال اليومية فهذا يؤدّي إلى إرهاق القلب وأعضاء الجسم المختلفة.', '2023-05-11 10:25:15', 'عبد الرحمن'),
(79, 'همية المدونة الشخصية: كيف تساعدك في تحقيق أهدافك والتعبير عن نفسك على الإنترنت؟', 'بلوجر', '157_أهمية-المدونة-الشخصية.jpg', 'تعد المدونة الشخصية وسيلة رائعة للتعبير عن الذات ومشاركة الخبرات والاهتمامات مع الآخرين على الإنترنت. وتتميز المدونة الشخصية بأنها ملكية شخصية، حيث يملك الفرد القدرة الكاملة على محتواها وإدارتها، ما يجعلها وسيلة مثالية للتعبير عن الذات وتحقيق الأهداف الشخصية والمهنية. وفيما يلي سنستعرض بعض الأهمية الرئيسية لإنشاء مدونة شخصية:\r\n\r\n1- التعبير عن الذات: تعتبر المدونة الشخصية وسيلة مثالية للتعبير عن الذات ومشاركة الآخرين اهتماماتك وخبراتك وآرائك في مجال معين، مما يمنحك فرصة لبناء هوية شخصية مميزة على الإنترنت.\r\n\r\n2- تحقيق الأهداف الشخصية والمهنية: يمكن للمدونة الشخصية أن تساعدك في تحقيق أهدافك الشخصية والمهنية، سواء كانت هذه الأهداف تعليمية أو اجتماعية أو مهنية. ويمكنك استخدام المدونة لتسويق خدماتك ومنتجاتك وتطوير شبكة علاقاتك الاجتماعية والمهنية.\r\n\r\n3- تحسين مهارات الكتابة: يمكن للمدونة الشخصية أن تساعدك في تحسين مهارات الكتابة الخاصة بك، حيث يتطلب إدارة المدونة كتابة مقالات جيدة ومعلومات مفيدة للقراء، مما يمنحك فرصة لتحسين مهاراتك في الكتابة والتعبير.\r\n\r\n4- بناء مجتمع افتراضي: تسمح المدونة الشخصية للمدون ببناء مجتمع افتراضي حول اهتماماته ومواضيعه المفضلة، حيث يمكن للقراء التفاعل مع المدون والتعليق على مقالاته ومشاركة آرائهم وخبراتهم، ما يساعد على بناء علاقات اجتماعية وتوسيع دائرة المعارف.\r\n\r\n5- زيادة الوعي والتثقيف: يمكن للمدونة الشخصية أن تلعب دورًا هامًا في زيادة الوعي والتثقيف بشأن مواضيع مختلفة، وخاصة في مجالات الأخبار التقنية والتكنولوجيا والتعليم والأخبار العامة.\r\n\r\nفعن طريق كتابة مقالات متخصصة ومعلومات مفيدة وتحليلات دقيقة، يمكن للمدون أن يزيد من معرفة القراء ويساهم في نشر الوعي والمعرفة بشكل عام.\r\n\r\nبالإضافة إلى ما سبق، يمكن لإنشاء مدونة شخصية أن يساعدك في تطوير مهاراتك في مجالات الإدارة والتسويق الإلكتروني، كما يمكن للمدونة أن تكون مصدر دخل إضافي عن طريق عرض الإعلانات أو بيع المنتجات والخدمات المتعلقة بمجال اهتماماتك.\r\n\r\n', '2023-05-11 10:27:35', 'عبد الرحمن'),
(80, 'أذكار الصباح والمساء… فضلها وما قيل عن ثواب المداوم عليها', 'اسلاميلات', '159_817119_0.jpg', 'ذكر الله تعالى والإكثار من ترديد الأذكار اليومية بما فيها أذكار الصباح والمساء من الأشياء التي تَقِينا من الشرور والأخطار وتجعلنا في حفظ الله تعالى على الدوام، ومما نهتم به التعرف على فضل قراءة أذكار الصباح والمساء. <br>\r\nوهي الأذكار التي نبدأ بها يومنا ونختِم يومنا بها كذلك، فهذَه الأذكار لا تتطلب منا عناء أو مجهود سوى ترديدها في الأوقات المُخصصة لها فهي عبادة عظيمة وخفيفة ويسهُل القِيام بها، فتحريك اللسان فقط وقراءتها مع استحضار القلب والعقل للدعاء بها يعود علينا بالكثير من الفضل والفوائد، وقد تضمن فضل قراءة أذكار الصباح والمساء حسب موقع المحيط الكثير مما يجب معرفته من فوائد لمن يواضِب عليها ويقوم بها بشكل يومي في ساعات الصباح والمساء.<br>\r\nفضل قراءة أذكار الصباح والمساء كل يوم<br>\r\n\r\nمن يرغب في الحفاظ على ترديد الأذكار اليومية وخاصة أذكار الصباح والمساء فإن لهما أوقات خاصة بهما ويجب استحضار القلب والعقل والشروع في هذه الأذكار لكي بقى بحِفظ الله ورعايته، وينال بإذن الله كُل الخير والفضل الذي يترتب على هذه الأذكار، فقد قال الله تعالى \" أذكروني أذكركم \" فذكر الله عِبادة وطاعة ويترتب عليها ذكر الله لنا وحفظنا ورعايتنا، ومما جاء في فضل قراءة اذكار الصباح والمساء ما يلي:\r\n<br>\r\n- كسب رضا الله عزّ وجلّ.<br>\r\n\r\n- حفظ المكان الذي يبيت فيه الإنسان.<br>\r\n\r\n- دوام الصلة بالله - عزّ وجلّ- والقرب منه والأنس به.<br>\r\n<br>\r\n- ذكر الله عزّ وجلّ للعبد في الملأ الأعلى.\r\n<br>\r\n- الحفظ من الحسد والعين.\r\n<br>\r\n- إمداد الجسم بالقوة والطاقة.\r\n<br>\r\n- مغفرة الذنوب والسيئات.\r\n<br>\r\n- زيادة الحسنات والثواب.\r\n<br>\r\n- دخول الجنة بفضل الله وكرمه.\r\n<br>\r\n- الحفظ من شر الإنس والجنّ وشر كلّ المخلوقات.\r\n<br>\r\n- التمتع بحفظ الله عزّ وجلّ وحمايته.\r\n<br>\r\n- دوام نعم الله - جلّ وعلا- والبركة فيها.\r\n<br>\r\n- كفاية الهم والغم والحزن في الدنيا والآخرة.\r\n<br>\r\n- طمأنينة القلب وانشراح الصدر.\r\n<br>\r\n- التحصن من الشيطان ومكائده\r\n<br>\r\nفضائل قراءة أذكار الصباح والمساء\r\n<br>\r\nيجب تحريك الشفايف وترديد الأذكار بصوت مُنخفِض يسمعه القاريء وقراءتها بشكل مُتأني والتعرف على المعاني التي تحملها الكلمات والعبارات التي جاءت في هذه الأذكار والمنهاج الصحيح، وهذا يتطلب قراءتها بطريقة بطيئة وعدم التسرع في الفراغ منها كما أنه لا يُشترط الوضوء عند قراءتها ولكن النوم على وضوء من الأُمور التي وردت عن النبي صلى الله عليه وسلم، ويتم النوم على الجنب اليمين والشروع في قراءة اذكار المساء بالإضافة إلى الأدعية المفضلة قبل النوم.\r\n<br>\r\nإن فضل قراءة أذكار الصباح والمساء والمحافظة عليها هي إنشراح للصدر واستحضار حفظ الله ومعيته لنا ومن ذكر الله في حياته ذكره الله في الملأ، فقد جاء في الحديث الشريف عن الرسول صلى الله عليه وسلم \" يقول الله عز وجل أنا عند ظن عبدي بي، وأنا معه حين يذكرني إن ذكرني في نفسه ذكرته في نفسي، وإن ذكرني في ملأ ذكرته في ملأ هم خير منهم \" هذا كله مدعاة للحفاظ على الأذكار اليومية وخاصة أذكار الصباح والمساء.', '2023-05-12 00:09:01', 'عبد الرحمن'),
(81, ' فضل سورة يس وأسرارها.. 10 عجائب تجعلك لا تتوقف عن قراءتها', 'اسلاميلات', '80_393.webp', 'فضل سورة يس  في كل وقت سواء قبل النوم أو بعد صلاة الفجر وما نحوها، وكذلك أسرار وعجائب سورة يس ، لعلها من تلك الكنوز التي يبحث عنها كثيرون، ولا يفوتها لبيب، وحيث إن فضل سورة يس عظيم ، خاصة في قضاء الحوائج، ومن منا ليس له حاجة يتمنى أن يقضيها الله سبحانه وتعالى له وكذلك مغفرة الذنوب ، من هنا تنبع أهمية معرفة المزيد عن فضل سورة يس قبل النوم واسرارها وعجائب سورة يس ، ويمكن القول إن من لا يغتنم فضل سورة يس فإنه خسران خسارة لا تعوض<br>\r\nفضل سورة يس ،  ورد في الشرع عن فضل قراءة سورة يس وعِظَمِ ثواب قراءتها؛ في نحو ما أخرجه الدارمي والترمذي -واللفظ له- والبيهقي في \"شعب الإيمان\" من حديث أنس بن مالك رضي الله عنه عن النبي صلى الله عليه وآله وسلم قال: «إِنَّ لِكُلِّ شَيْءٍ قَلْبًا، وَقَلْبُ القُرْآنِ يس، وَمَنْ قَرَأَ يس كَتَبَ اللهُ لَهُ بِقِرَاءَتِهَا قِرَاءَةَ القُرْآنِ عَشْرَ مَرَّاتٍ»، وإنّ أقوى ما جاء في فضل سورة يس ما رواه ابن كثير في تفسيره، قال –صلى الله عليه وسلم-: «من قرأ يس في ليلة أصبح مغفورًا له»، كما وأخرج الطبراني وابن مردويه من حديث أنس رضي الله عنه مرفوعًا: «مَنْ دَاوَمَ عَلَى قِرَاءَةِ يس كُلَّ لَيْلَةٍ ثُمَّ مَاتَ، مَاتَ شَهِيدًا»\r\n<br>\r\nفضل قراءة سورة يس يوميا<br>\r\n\r\nمغفرة الذنوب وتكفير السيئات، وما ذلك على الله بعزيز، كما أن من فضل قراءة سورة يس يوميا ما ورد عن جندب -رضي الله عنه- قال: قال النبي -عليه الصلاة والسلام-: «مَن قرَأ يس في ليلةٍ ابتغاءَ وجهِ اللهِ غُفِر له»\r\n<br>\r\nفضل سورة يس للمحتضر\r\n<br>\r\nفضل قراءة سورة يس للمحتضر\r\n<br>\r\n فضل قراءة سورة يس للمحتضر  ، جاء في رواية أخرى الوصية بقراءتها على من حان أجله من المسلمين؛ فعن معقل بن يسار -رضي قراءة سورة يس على المحتضر لله عنه- عن رسول الله -عليه السلام- أنّه قال: «اقرَؤوا على موتاكم يس»، كما رأى جمهور علماء الأمة ومنهم الشافعية والحنفية والحنابلة أنّ قراءة سورة يس على المحتضر سُنّة، واستدلوا على ذلك بحديث النبي -عليه الصلاة والسلام-: «اقرءوا يس على موتاكُم»، والسبب في استحباب العلماء لقراءة هذه السورة عند المحتضر أنّها تشتمل على التوحيد والمعاد، كما أنّ فيها بشارة للمؤمن الذي يموت على التوحيد بالجنة والعاقبة الحسنة في الآخرة، ومن ذلك قوله- تعالى-: «قِيلَ ادْخُلِ الْجَنَّةَ ۖ قَالَ يَا لَيْتَ قَوْمِي يَعْلَمُونَ*بِمَا غَفَرَ لِي رَبِّي وَجَعَلَنِي مِنَ الْمُكْرَمِينَ»، فسماع هذه الآية فيه بشارة للمؤمن في حال احتضاره، والاستبشار فيه تسهيل لخروج الروح من الجسد\r\n<br>\r\nفضل سورة يس للميت \r\n<br>\r\nفضل قراءة سورة يس للميت خاصة تهون عليه في قبره وتنيره، كما تتنزل بها الرحمات والتجليات الإلهية بالمغفرة والرضا من الله عز وجل عليه\r\n<br>\r\nفضل سورة يس وأسرارها\r\n<br>\r\nفضل سورة يس واسرارها ، ورد فيها أن من أراد أن يقضي الله حاجته فعليه ان يتوضأ ويحسن الوضوء ويصلى ركعتين صلاة الحاجة، إلا أن هناك أمر آخر وهو سورة يس، حيث علمنا أهل الله أن سورة يس فيها سر لما قرئت له، هكذا قال المصطفى صلى الله عليه وسلم، لكننا لا نجرب مع الله، فنقرأ القرأن كله تقربًا للمولى عز وجل. \r\n<br>\r\nفضل سورة يس واسرارها ، وورد فيها أن سورة يس فيها تفريجًا للهموم وقضاءً للحوائج وشفاءً للأمراض ورحمة للأموات وأسرار عظيمة، ولكن لها خصوصية عن باقي سور القرأن الكريم، فالزام يس بيقينك بالإخلاص يعطيك المولى عز وجل ما تحتاجه. \r\n<br>\r\nأسرار سورة يس لقضاء الحاجة\r\n<br>\r\nفضل قراءة سورة يس 7 مرات\r\n<br>\r\nفضل قراءة سورة يس 7 مرات\r\n<br>\r\nفضل قراءة سورة يس 7 مرات  ، جاء فيها أن قراءة القرآن من الأعمال الصالحة، والإنسان يُثاب على الحرف بعشر حسنات، كما ورد عن رسول الله -صلى الله عليه وسلم-، وأن الماهر في القرآن مع السفرة الكرام البررة، والذي يقرأ القرآن وهو عليه شاق ويتتعتع فيه، فله أجران\r\n<br>\r\nالسور كما هي دون تبديل الآيات أو تكرار بعض كلمات\r\n<br>\r\nفضل قراءة سورة يس بعد صلاة الفجر\r\n<br>\r\nفضل قراءة سورة يس بعد صلاة الفجر ورد في السنة النبوية المطهرة الحث على ذكر الله تعالى بعد صلاة الفجر ؛ ومن ذلك ما رواه الإمام الترمذي في «جامعه» من حديث أنس بن مالك رضي الله عنه قال: قال رسول الله صلى الله عليه وآله وسلم: «مَنْ صَلَّى الْغَدَاةَ فِي جَمَاعَةٍ ثُمَّ قَعَدَ يَذْكُرُ اللهَ حَتَّى تَطْلُعَ الشَّمْسُ ثُمَّ صَلَّى رَكْعَتَيْنِ كَانَتْ لَهُ كَأَجْرِ حَجَّةٍ وَعُمْرَةٍ؛ تَامَّةٍ تَامَّةٍ تَامَّة»، وبناء عليه \r\n<br>\r\nقراءة سورة يس بعد صلاة الفجر ، ولا بأس بالمواظبة على قراءة يس بعد صلاة الفجر ، ولكن بشرط أن يتم ذلك بشكل ليس فيه تشويش على بقية الذاكرين وقُرّاء كتاب الله تعالى؛ استرشادًا.....', '2023-05-12 00:16:29', 'عبد الرحمن'),
(82, 'أهمية الكتابة', 'بلوجر', '800_أهمية_الكتابة.jpg', 'الكتابة وسيلة للتواصل يعتبر التواصل من أهم الأمور التي يحتاج الإنسان إليها في حياته؛ وذلك لأنّه العملية التي تساعده على قضاء حوائجه بشكل كامل، كما أن التواصل يساعد على الارتقاء بالإنسان روحياً ودينياً بشكل كبير وملحوظ، بالإضافة إلى أنه وسيلة مهمّة لاكتساب العلوم والمعارف، وهو شرط أساسي من شروط الاستمتاع بمباهج الحياة المختلفة. الكتابة هي إحدى أهم وأبرز طرق التواصل بين الناس منذ العصور القديمة إلى العصور الحالية، ولشدة أهميتها عبر التاريخ الإنساني، فقد عدَّ المتخصصون اكتشاف الكتابة واحدةً من أهم الإنجازات الإنسانية عبر التاريخ، فباتوا يصنّفون الأحداث التاريخية بناءً على بعدها أو قربها زمانياً من هذه اللحظة المفصلية من حياة الإنسان. لم تنل الكتابة هذه الأهمية من فراغ، بل لما تقدمه من خدمات جليلة للإنسان، وفيما يلي إيضاح موجز لأهمية الكتابة بالنسبة للإنسان. أهمية الكتابة الوسيلة الرئيسية لحفظ العلوم، والخبرات، والتجارب الحياتية، والاستنتاجات، والآراء، والأقوال، والسير، والأحداث التاريخية؛ فدون الكتابة سيبدأ كل من يحاول إضافة شيء إلى مسيرة الإنسانية من الصفر، ولن يكون هناك أي نوع من أنواع تراكم العلوم، أو الخبرات. وسيلة مهمة للتعبير عن المشاعر الدفينة للآخرين في محاولة لتقريب المسافات بين المرسِل والمرسَل إليه، فللكلمة وقع السحر على النفس الإنسانية؛ فهي الوحيدة القادرة على التغلغل إلى الأعماق، والتأثير في الإنسان، وربما قلب حياته رأساً على عقب. طريقة من طرق الإبداع، وإبراز المواهب والقدرات، خاصة من خلال ما يعرف بفن الرواية، أو القصة، أو الشعر؛ حيث تساعد مثل هذه الفنون على تطوير شخصية الإنسان، والنهوض به روحياً ونفسياً أيضاً. وسيلة للتنفيس عن مكنونات النفس الداخلية، والتي تحتاج بين الحين والآخر إلى الخروج، ولن تجد لها سبيلاً أفضل من التدوين والكتابة. وسيلة ناجعة يتبعها من ينوون المساهمة في إحداث إصلاح حقيقي في مجتمعاتهم، وبلدانهم؛ حيث يمكنهم من خلالها بث الأفكار، وإيصالها إلى أكبر عدد من المتلقّين، والمتفاعلين. للكتابة دور كبير وفعال في زيادة معلومات الإنسان وتكثيرها، فبمقدورها أن تجعل من الإنسان شخصاً موسوعياً خاصّةً إن كان من الأشخاص الذين يتميزون بتعدد اهتماماتهم. تعتبر في أيامنا هذه وسيلةً من وسائل الحصول على دخل مادي جيد، إمّا من خلال تأليف الكتب، أو كتابة المقالات، أو التدوين عبر شبكة الإنترنت، كما وتعتبر أيضاً وسيلةً من وسائل اكتساب الشهرة، خاصّةً إن تمتّع الكاتب بأسلوب ساحر، وقلم جميل. تنمّي من قدرات الإنسان العقلية، وقد تسهم في بعض الأحيان في تنمية علاقاته الاجتماعية، هذا عدا عن كونها وسيلةً مهمة من وسائل النجاح في الحياة، وقضاء الاحتياجات المختلفة.\r\n', '2023-05-12 00:19:40', 'عبد الرحمن'),
(83, 'تعرف على أول لغة برمجية بديهية للحواسيب الكمومية', 'برمجة', '607_First-Quantum-Programming-Language-2048x1024.jpg', 'طور علماء الحاسوب أول لغة برمجة كمومية تحل الحسابات المعقدة بذكاء وبساطة وأمان. صمم علماء الحاسوب بالمعهد الفدرالي للتكنولوجيا في زيورخ أول لغة برمجية تُستخدَم في برمجة أجهزة الحواسيب الكمومية ببساطة وموثوقية وأمان، كأجهزة الحواسيب الكلاسيكية.\r\n\r\n\r\nقال مارتن فيتشيف، أستاذ علوم الحاسوب في مختبر الأنظمة الموثوقة والذكية في مركز معهد زيورخ للدراسات الأمنية: «أنا متحمس للغاية، إذ لا تزال برمجة أجهزة الحاسوب الكمومية تتحدى الباحثين، والآن نستطيع مواصلة نهج معهد زيورخ في تطوير أجهزة الحاسوب الكمومية ولغات البرمجة. تسمح لغتنا الكمومية (سيلك Silq) للمبرمجين باستخدام إمكانيات أجهزة الحواسيب الكمومية استخدامًا أفضل من لغات البرمجة الحالية، إذ أصبحت الشفرة أصغر حجمًا وأسرع وأكثر بديهية وأقرب لفهم المبرمجين».\r\n\r\nسيقدم فيتشيف لغة البرمجة سيلك إلى خبراء المجال، خلال مؤتمر جمعية الاتصالات الرائدة 2020 الخاص بلغات البرمجة، ولتسهيل المناقشة والاعتماد وزيادة وتيرة التطوير، أطلق فيتشيف وفريقه الموقع الرسمي الخاص بلغة البرمجة سيلك.\r\n\r\nشهدت الحوسبة الكمومية اهتمامًا متزايدًا خلال العقد الماضي، نظرًا إلى امتلاك هذه الحواسيب -التي تعمل وفقًا لمبادئ فيزياء الكم- إمكانيات هائلة، إذ يظن معظم الباحثين اليوم أن هذه الحواسيب الكمومية ستستطيع يومًا ما حل مشكلات معينة بسرعة أكبر من أجهزة الحواسيب الكلاسيكية، فهي تستخدم في إجراء عملياتها الحسابية حالات كمية معقدة تتداخل فيها أجزاء مختلفة من المعلومات في وقت معين، ما يعني أن أجهزة الحواسيب الكمومية ستحل مستقبلًا المشكلات التي تعجز أجهزة الحواسيب الكلاسيكية عن حلها في إطار زمني معقول.\r\n\r\nلم يُثبَت هذا التفوق الكمي إثباتًا قاطعًا، ومع ذلك، فقد أُنجزِت بعض التطورات التقنية المهمة حديثًا، ففي أواخر صيف 2019، نجح حاسوب كمومي في حل مشكلة -وإن كانت محدودة للغاية- بسرعة تفوق أسرع حاسوب كلاسيكي.\r\n\r\n', '2023-05-12 00:21:45', 'عبد الرحمن');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `admin`
--
ALTER TABLE `admin`
  ADD PRIMARY KEY (`id_pass`);

--
-- Indexes for table `categories`
--
ALTER TABLE `categories`
  ADD PRIMARY KEY (`cat_id`);

--
-- Indexes for table `post`
--
ALTER TABLE `post`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `admin`
--
ALTER TABLE `admin`
  MODIFY `id_pass` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `categories`
--
ALTER TABLE `categories`
  MODIFY `cat_id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=37;

--
-- AUTO_INCREMENT for table `post`
--
ALTER TABLE `post`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=84;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
